libxmlbus/data/wsaddr-testset/documents/echo/soap12/message9.xml

<?xml version="1.0"?>
<!-- $Id: message9.xml,v 1.5 2006/02/20 16:01:17 pdowney Exp $ -->
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <env:Header>
    <wsa:Action>http://example.org/action/echoIn</wsa:Action>
    <wsa:To>http://example.org/node/A</wsa:To>
    <wsa:MessageID>urn:uuid:C5BBE4F7-418A-4282-B985-F20555BEBDE9</wsa:MessageID>
    <wsa:ReplyTo>
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
      <wsa:ReferenceParameters xmlns:customer="http://example.org/customer">
        <customer:CustomerKey>Key#123456789</customer:CustomerKey>
      </wsa:ReferenceParameters>
    </wsa:ReplyTo>
    <wsa:FaultTo>
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
      <wsa:ReferenceParameters xmlns:customer="http://example.org/customer">
        <customer:CustomerKey>Fault#123456789</customer:CustomerKey>
      </wsa:ReferenceParameters>
    </wsa:FaultTo>
  </env:Header>
  <env:Body>
    <m:echoIn xmlns:m="http://example.org/echo"/>
  </env:Body>
</env:Envelope>
